In [1]:
import pandas as pd
df = pd.read_csv('Titanic.csv')
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,1
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,0
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,0
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,0

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  34.5   7.8292         0
1       3  female  47.0   7.0000         1
2       2    male  62.0   9.6875         0
3       3    male  27.0   8.6625         0
4       3  female  22.0  12.2875         1

In [7]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [9]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       0     1

In [10]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age    Fare  female  male
0       3    male  34.5  7.8292       0     1
1       3  female  47.0  7.0000       1     0
2       2    male  62.0  9.6875       0     1

In [12]:
inputs.drop('Sex', axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age    Fare  female  male
0       3  34.5  7.8292       0     1
1       3  47.0  7.0000       1     0
2       2  62.0  9.6875       0     1

In [13]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [15]:
inputs.Age[:20]

0     34.5
1     47.0
2     62.0
3     27.0
4     22.0
5     14.0
6     30.0
7     26.0
8     18.0
9     21.0
10     NaN
11    46.0
12    23.0
13    63.0
14    47.0
15    24.0
16    35.0
17    21.0
18    27.0
19    45.0
Name: Age, dtype: float64

In [47]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()
inputs.Fare = inputs.Fare.fillna(inputs.Fare.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [48]:
from sklearn.model_selection import train_test_split
cc

In [49]:
len(X_train)

334

In [50]:
len(X_test)

84

In [51]:
len(inputs)

418

In [52]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [53]:
model.fit(X_train, y_train)

GaussianNB()

In [54]:
model.score(X_train, y_train)

1.0

In [55]:
X_test[:10]

     Pclass       Age      Fare  female  male
34        1  30.00000   57.7500       0     1
74        1  35.00000  211.5000       1     0
216       3  30.27259    7.8792       1     0
346       2  26.00000   13.0000       0     1
275       2  20.00000   26.0000       1     0
410       3  30.27259    7.7500       1     0
191       1  30.27259   26.0000       0     1
164       2  41.00000   13.0000       0     1
256       3  30.27259    7.7500       0     1
16        2  35.00000   12.3500       0     1

In [56]:
y_test[:10]

34     0
74     1
216    1
346    0
275    1
410    1
191    0
164    0
256    0
16     0
Name: Survived, dtype: int64

In [57]:
model.predict(X_test[:10])

array([0, 1, 1, 0, 1, 1, 0, 0, 0, 0], dtype=int64)

In [58]:
model.predict_proba(X_test[:10])

array([[1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.]])